trunk/fireFoam-1.6-1.0/tutorials/hotPlateLaminar/0/b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/raid/users/YW/RUN/lesBuoyantFoam";
    case "Counterflow_simple";
    instance "0.0005";
    local "";

    class volScalarField;
    object b;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    wallHot
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
    cold
    {
        type            zeroGradient;
    }
    sides1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
