trunk/fireFoam-1.6-1.0/tutorials/hotPlateLaminar/0/k
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    wallHot           
    {
        type            fixedValue;
        value           uniform 1e-05;
    }

    up          
    {
        type            inletOutlet;
        inletValue      uniform 1e-05;
        value           uniform 1e-05;
    }

    down           
    {
        type            inletOutlet;
	inletValue	uniform 1e-05;
        value           uniform 1e-05;
    }

    cold          
    {
        type            inletOutlet;
        inletValue      uniform 1e-05;
        value           uniform 1e-05;
    }

    sides1
    {
        type            cyclic;
    }
}



// ************************************************************************* //
