trunk/fireFoam-1.6-1.0/tutorials/hotPlateLaminar/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    wallHot           
    {
        type            calculated;
        value           uniform 101325;
    }

    up      
    {
        type            calculated;
        value           uniform 101325;
    }

    down           
    {
        type            calculated;
        value           uniform 101325;
    }

    cold          
    {
        type            calculated;
        value           uniform 101325;
    }

    sides1
    {
        type            cyclic;
    }

}


// ************************************************************************* //
