trunk/fireFoam-1.6-1.0/tutorials/hotPlateLaminar/0/pd
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wallHot           
    {
//	type			fixedFluxBuoyantPressure;
	type			buoyantPressure;
	value			uniform 0;
    }

    up          
    {
	type			zeroGradient;
    }


    down           
    {
    	type			totalPressure;
	U			U;
	phi			phi;
	rho			rho;
	psi			none;
	gamma			0;//1.4;
	p0			uniform 0;
	value			uniform 0;
    }

    cold          
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           0;//1.4;
        p0              uniform 0;
        value           uniform 0;
    }

    sides1    
    {
        type            cyclic;
	value		uniform 0;
    }

}


// ************************************************************************* //
