trunk/fireFoam-1.6-1.0/tutorials/hotPlateLaminar/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermophysicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//thermoType      hhuMixtureThermo<inhomogeneousMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;
//thermoType      hMixtureThermo<inhomogeneousMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;
//thermoType      hMixtureThermo<fireMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;
thermoType      hPsiMixtureThermo<fireMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;

/*
// for pure mathanole (CH3OH), air combustion 
stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 6.428909782;

fuel            fuel 1 32.04186 200 5000 1000 1.78970791E+0 1.40938292E-02	-6.36500835E-06	1.38171085E-09	-1.17060220E-13	-2.53748747E+04	1.45023623E+01	5.71539582E+00	-1.52309129E-02	6.52441155E-05	-7.10806889E-08	2.61352698E-11	-2.56427656E+04	-1.50409823E+00 1.67212e-06 170.672;

oxidant         oxidant 1 28.8507321 200 6000 1000 3.00140845E+00	1.48694964E-03	-6.08284964E-07	1.23764534E-10	-9.88747461E-15	-9.57600225E+02	5.86975138E+00	3.40031132E+00	4.82825576E-04	-1.06185141E-06	2.42243725E-09	-1.24977367E-12	-1.02994269E+03	3.88888119E+00 1.67212e-06 170.672;

burntProducts   burntProducts 1 27.55047769 200 6000 1000 3.05922394E+00	1.98615689E-03	-6.65412467E-07	1.04036939E-10	-5.97883306E-15	-1.31912430E+04	5.31659215E+00	3.39798529E+00	1.48775514E-03	-1.90223733E-06	2.69692055E-09	-1.20239812E-12	-1.32774651E+04	3.52813494E+00 1.67212e-06 170.672;


// for 25% methane (25%CH4,75%air), air combustion 
stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 1.833494129;

fuel            fuel 1 25.648674 200 5000 1000 2.26976921E+00	4.46294891E-03	-1.88942825E-06	3.98554738E-10	-3.28694135E-14	-3.08528632E+03	9.01164304E+00	3.83770252E+00	-3.05562552E-03	1.14986264E-05	-1.03017477E-08	3.23001865E-12	-3.33411891E+03	1.75633495E+00  1.67212e-06 170.672;

oxidant         oxidant 1 28.8507321 200 6000 1000 3.00140845E+00 1.48694964E-03 -6.08284964E-07 1.23764534E-10	-9.88747461E-15	-9.57600225E+02	5.86975138E+00	3.40031132E+00	4.82825576E-04	-1.06185141E-06	2.42243725E-09	-1.24977367E-12	-1.02994269E+03	3.88888119E+00 1.67212e-06 170.672;

burntProducts   burntProducts 1 27.63321954 200 6000 1000 3.03553023E+00 1.89712851E-03	-6.48089220E-07	1.03488923E-10	-6.11724501E-15	-1.09987832E+04	5.43524228E+00	3.38023818E+00	1.47354528E-03	-2.27055018E-06	3.22314085E-09	-1.42443396E-12	-1.10871284E+04	3.60359175E+00  1.67212e-06 170.672;
*/

// for pure methane (100%CH4), air combustion 
stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 17.1271;

fuel            fuel 1 16.0428 200 6000 1000 1.63543 0.0100844 -3.36924e-06 5.34973e-10 -3.15528e-14 -10005.6 9.9937 5.14988 -0.013671 4.91801e-05 -4.84744e-08 1.66694e-11 -10246.6 -4.64132  1.67212e-06 170.672;

oxidant         oxidant 1 28.8504 200 6000 1000 3.10131 0.00124137 -4.18816e-07 6.64158e-11 -3.91274e-15 -985.266 5.35597 3.58378 -0.000727005 1.67057e-06 -1.09203e-10 -4.31765e-13 -1050.53 3.11239 1.67212e-06 170.672;

burntProducts   burntProducts 1 27.6334 200 6000 1000 3.0602 0.00182422 -5.93878e-07 8.93807e-11 -4.97595e-15 -10998.7 5.32209 3.54628 0.000378279 2.02797e-07 9.31602e-10 -6.84016e-13 -11102.1 2.90098 1.67212e-06 170.672;


/*
// for pure ethylene (100%C2H4), air combustion 
stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 14.6915;

fuel            fuel 1 28.0536 200 6000 1000 4.39855 0.00962286 -3.16638e-06 4.57476e-10 -2.36594e-14 4115.32 -2.46274 1.21766 0.0130027 3.50374e-06 -1.11555e-08 4.72032e-12 5337.38 15.4802 1.67212e-06 170.672;

oxidant         oxidant 1 28.8504 200 6000 1000 3.10131 0.00124137 -4.18816e-07 6.64158e-11 -3.91274e-15 -985.266 5.35597 3.58378 -0.000727005 1.67057e-06 -1.09203e-10 -4.31765e-13 -1050.53 3.11239 1.67212e-06 170.672;

burntProducts   burntProducts 1 28.7983 200 6000 1000 3.13683 0.00177905 -5.9526e-07 9.13728e-11 -5.15912e-15 -11006.9 4.98263 3.46469 0.000817749 -4.50099e-07 1.40148e-09 -8.26988e-13 -11065.7 3.37527 1.67212e-06 170.672;


// for pure propane (C3H8) air combustion
stoichiometricAirFuelMassRatio stoichiometricAirFuelMassRatio [0 0 0 0 0 0 0] 15.675;

fuel            fuel 1 44.0962 200 5000 1000 7.53414 0.0188722 -6.27185e-06 9.14756e-10 -4.78381e-14 -16467.5 -17.8923 0.933554 0.0264246 6.10597e-06 -2.19775e-08 9.51493e-12 -13958.5 19.2017 1.67212e-06 170.672;

oxidant         oxidant 1 28.8504 200 6000 1000 3.10205 0.00123963 -4.17512e-07 6.60292e-11 -3.87448e-15 -985.517 5.35187 3.58378 -0.0007269 1.66985e-06 -1.08452e-10 -4.31951e-13 -1050.53 3.11223 1.67212e-06 170.672;

burntProducts   burntProducts 1 28.3233 200 6000 1000 3.106 0.00179682 -5.94382e-07 9.04998e-11 -5.08033e-15 -11003.7 5.11872 3.49612 0.000650364 -2.08029e-07 1.2291e-09 -7.73697e-13 -11080.3 3.18978 1.67212e-06 170.672;
*/



// ************************************************************************* //
